### concat
- 분리되어진 데이터이 union 처리
- 상하결합(axis = 0), 좌우결합(axis =1) 가능, axis = 0 가 default

In [2]:
run profile1

In [4]:
s1 = Series([1,2,3,4])
s2 = Series([5,6,7,8,9])

In [5]:
pd.concat([s1,s2], axis =0)   # 상하 결합

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
4    9
dtype: int64

In [6]:
pd.concat([s1,s2], ignore_index = True) # 상하 결합

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [7]:
pd.concat([s1,s2],axis = 1)  # 좌우 결합, 서로 같은 key 끼리 결합함 outer join과 비슷하다

     0  1
0  1.0  5
1  2.0  6
2  3.0  7
3  4.0  8
4  NaN  9

In [8]:
pd.concat([s1,s2], axis=1, join = 'inner')  # 양쪽에 존재하는 key만 출력

   0  1
0  1  5
1  2  6
2  3  7
3  4  8

------

### conbine_first
- df1.combine_first(df2)
- 같은 key를 갖는 경우 df의 NA를 df2의 값으로 수정
- 서로 다른 key를 갖는 경우 df2의 key를 df1에 추가

In [16]:
df1 = DataFrame(np.arange(1,5).reshape(2,2), columns = ['a','b'])
df2 = DataFrame(np.arange(5,9).reshape(2,2), columns = ['a','b'])
df3 = DataFrame(np.arange(9,13).reshape(2,2), columns = ['a','b'])

In [23]:
df3

    a   b
0   9  10
1  11  12

In [24]:
df2

   a  b
0  5  6
1  7  8

In [19]:
df1.loc[1,1]=NA

In [13]:
df1.combine_first(df2) # df1의 NA가 df2의 동일 key값의 value로 대체

    1  a  b
0 NaN  1  2
1 NaN  3  4

In [25]:
df1.combine_first(df3)  # df1에 없는 df3의 key 데이터 추가(없으면 추가되는 형식)

    1  a  b
0 NaN  1  2
1 NaN  3  4

In [26]:
np.where(df1.b.isnull(), df2.b, df1.b)

array([2, 4])

[ 참고 - chunksize를 지정한 데이터 부분 불러오기]

In [31]:
df_pf = pd.read_csv('professor.csv', chunksize = 30)

----------

### pandas 중복 관련 메서드 duplicate

In [35]:
s1 = Series([1,1,2,3,4])

In [36]:
s1.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [37]:
s1[s1.duplicated()]   # 중복 된 값 출력

1    1
dtype: int64

In [38]:
s1[~s1.duplicated()]  # 중복된 값 제거

0    1
2    2
3    3
4    4
dtype: int64

In [45]:
s1.drop_duplicates()   # 중복된 값 제거

0    1
2    2
3    3
4    4
dtype: int64